<template>
  <div id="license-page">
    <div class="logo">
      <div class="container">
        <div class="row">
          <h1 class="col">ServiceDriver</h1>
        </div>
      </div>
    </div>
    <div class="container">
      <div class="offset-2 first">
        <router-link to="/signup">
            <span class="prev-page">
              <svg aria-hidden="true" focusable="false" data-prefix="fas" data-icon="angle-left" class="svg-inline--fa fa-angle-left fa-w-8" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 256 512">
              <path fill="currentColor" d="M31.7 239l136-136c9.4-9.4 24.6-9.4 33.9 0l22.6 22.6c9.4 9.4 9.4 24.6 0 33.9L127.9 256l96.4 96.4c9.4 9.4 9.4 24.6 0 33.9L201.7 409c-9.4 9.4-24.6 9.4-33.9 0l-136-136c-9.5-9.4-9.5-24.6-.1-34z"></path>
            </svg>
              PREVIOUS PAGE
            </span>
        </router-link>
      </div>

      <div class="col-8 offset-2 license-block">
        <h2>Лицензионное соглашение</h2>
        <div class="content">
          <p>
            Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ServiceDriver (далее ServiceDriver или Администрация) с одной стороны и пользователем сайта с другой.
            Сайт ServiceDriver не является средством массовой информации.
            <br><br>
            Используя сайт, Вы соглашаетесь с условиями данного соглашения.<br>
            <strong>Если Вы не согласны с условиями данного соглашения, не используйте сайт ServiceDriver!</strong>
          </p>
          <p>
            <strong>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</strong>
          </p>
          <ul>
            <li>Текстовой информации</li>
            <li>Видеоматериалов</li>
            <li>Фотоматериалов</li>
            <li>Ссылок на материалы, размещенные на других сайтах</li>
          </ul>
          <p>
            <strong>Пользователь имеет право:</strong>
          </p>
          <ul>
            <li>осуществлять поиск информации на сайте</li>
            <li>получать информацию на сайте</li>
            <li>создавать информацию для сайта</li>
            <li>распространять информацию на сайте</li>
            <li>комментировать контент, выложенный на сайте</li>
            <li>изменять рейтинг пользователей</li>
            <li>копировать информацию на другие сайты с указанием источника</li>
            <li>копировать информацию на другие сайты с разрешения Администрации сайта</li>
            <li>копировать информацию на другие сайты с разрешения правообладателя</li>
            <li>требовать от администрации скрытия любой информации о пользователе</li>
            <li>требовать от администрации скрытия любой информации переданной пользователем сайту</li>
            <li>использовать информацию сайта в личных некоммерческих целях</li>
            <li>использовать информацию сайта в коммерческих целях с разрешения Администрации</li>
            <li>использовать информацию сайта в коммерческих целях с разрешения правообладателей</li>
          </ul>
          <p>
            <strong>Администрация имеет право:</strong>
          </p>
          <ul>
            <li>по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
            <li>ограничивать доступ к любой информации на сайте</li>
            <li>создавать, изменять, удалять информацию</li>
            <li>удалять учетные записи</li>
          </ul>
          <p>
            <strong>Пользователь обязуется:</strong>
          </p>
          <ul>
            <li>обеспечить достоверность предоставляемой информации</li>
            <li>обеспечивать сохранность личных данных от доступа третьих лиц</li>
            <li>обновлять Персональные данные, предоставленные при регистрации, в случае их изменения</li>
            <li>не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность</li>
            <li>не нарушать работоспособность сайта</li>
            <li>не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу</li>
            <li>не совершать действия, направленные на введение других Пользователей в заблуждение</li>
            <li>не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</li>
            <li>не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
            <li>не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
          </ul>
          <p>
            <strong>Администрация обязуется:</strong>
          </p>
          <ul>
            <li>поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
            <li>осуществлять разностороннюю защиту учетной записи Пользователя</li>
            <li>защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</li>
            <li>предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</li>
          </ul>
          <p>
            <strong>Ответственность сторон</strong>
          </p>
          <ul>
            <li>пользователь лично несет полную ответственность за распространяемую им информацию</li>
            <li>администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
            <li>в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
          </ul>
          <p>
            <strong>Условия действия Соглашения</strong>
          </p>
          <p>
            Данное Соглашение вступает в силу при любом использовании данного сайта.
            Соглашение перестает действовать при появлении его новой версии.
            Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
            При любом изменении данного соглашения, администрация будет оповещать пользователей удобным для нее способом.
          </p>
        </div>
      </div>
    </div>
    <Footer />
  </div>
</template>

<script>
export default {
  name: 'License',
  components: {
    Footer: () => import('@/components/Footer.vue')
  }
}
</script>

<style scoped>
#license-page {
  width: 100vw;
  overflow-x: hidden;
}

.logo {
  padding: 16px 0;
  background: rgb(206,159,252);
  background: linear-gradient(-90deg, rgba(206,159,252,1) 0%, rgba(115,103,240,1) 100%);
}

.logo h1 {
  font-family: "Montserrat", sans-serif;
  font-size: 25px;
  font-weight: 800;
  color: #fff;
  margin: 0;
}

.license-block {
  margin-top: 15px;
  padding: 45px;
  background: #fff;
  border-radius: 30px;
}

.license-block .content {
  margin-top: 45px;
}

.license-block .content p, .content li {
  margin-top: 24px;
  font-family: "Source Sans Pro", sans-serif;
  font-size: 18px;
  color: #6D7188;
}

.content li {
  margin-top: 0;
}

.license-block .content span {
  font-family: "Montserrat", sans-serif;
  font-size: 22px;
  font-weight: 600;
  color: #3B405C;
}

.footer {
  margin-top: 45px;
  padding: 30px 0;
}

.footer span {
  color: #C0BFD3;
  font-size: 16px;
  font-family: "Source Sans Pro", sans-serif;
}

#license-page span {
  font-family: "Source Sans Pro", sans-serif;
  font-family: 16px;
  font-weight: 600;
  color: #C0BFD3;
}

.prev-page svg {
  height: 10px;
}

.prev-page {
  font-family: "Source Sans Pro", sans-serif;
  font-size: 16px;
  font-weight: 600;
}

.router-link-active {
  color: #C0BFD3;
}

</style>
